# -*- coding: utf-8 -*-

locations = {
	"A楼": {
		"latitude": 34.133171,
		"longitude": 108.837420,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"B楼": {
		"latitude": 34.132297,
		"longitude": 108.838367,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"C楼": {
		"latitude": 34.131125,
		"longitude": 108.838983,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"D楼": {
		"latitude": 34.130856,
		"longitude": 108.841579,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"EI楼": {
		"latitude": 34.130878,
		"longitude": 108.839863,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"EII楼": {
		"latitude": 34.130856,
		"longitude": 108.841579,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"EIII楼": {
		"latitude": 34.130056,
		"longitude": 108.843268,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"F楼": {
		"latitude": 34.130654,
		"longitude": 108.843016,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"G楼": {
		"latitude": 34.129660,
		"longitude": 108.845244,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"信远楼": {
		"latitude": 34.131640,
		"longitude": 108.845415,
		"address": "中国陕西省西安市长安区兴隆街道外环北路西安电子科技大学(南校区)"
	},
	"图书馆": {
		"latitude": 34.131125,
		"longitude": 108.838983,
		"address": "中国陕西省西安市长安区兴隆街道内环南路西安电子科技大学(南校区)"
	},
	"大学生活动中心": {
		"latitude": 34.134972,
		"longitude": 108.835282,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"北操场": {
		"latitude": 34.136866,
		"longitude": 108.837269,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"北篮球场": {
		"latitude": 34.135555,
		"longitude": 108.836914,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"北乒乓球场": {
		"latitude": 34.134767,
		"longitude": 108.836694,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"游泳中心": {
		"latitude": 34.135084,
		"longitude": 108.835939,
		"address": "中国陕西省西安市长安区兴隆街道外环北路西安电子科技大学(南校区)"
	},
	"南操场": {
		"latitude": 34.131775,
		"longitude": 108.834004,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"南篮球场": {
		"latitude": 34.129421,
		"longitude": 108.832629,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"南乒乓球场": {
		"latitude": 34.130221,
		"longitude": 108.833132,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"远望谷体育馆": {
		"latitude": 34.126418,
		"longitude": 108.844544,
		"address": "中国陕西省西安市长安区兴隆街道内环南路西安电子科技大学(南校区)"
	},
	"博物馆": {
		"latitude": 34.125589,
		"longitude": 108.844337,
		"address": "中国陕西省西安市长安区兴隆街道内环南路西安电子科技大学(南校区)"
	},
	"网安大楼": {
		"latitude": 34.128353,
		"longitude": 108.842010,
		"address": "中国陕西省西安市长安区兴隆街道内环南路西安电子科技大学(南校区)"
	},
	"礼仪广场": {
		"latitude": 34.132006,
		"longitude": 108.842118,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
}
