var locations = {
	"A楼": {
		"latitude": 34.129522,
		"longitude": 108.840053,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"B楼": {
		"latitude": 34.132297,
		"longitude": 108.838367,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"C楼": {
		"latitude": 34.132313,
		"longitude": 108.839534,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"D楼": {
		"latitude": 34.131513,
		"longitude": 108.841024,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"E楼": {
		"latitude": 34.130354,
		"longitude": 108.842492,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"F楼": {
		"latitude": 34.130669,
		"longitude": 108.842978,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"G楼": {
		"latitude": 34.129667,
		"longitude": 108.845365,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"信远楼": {
		"latitude": 34.131643,
		"longitude": 108.839011,
		"address": "中国陕西省西安市长安区兴隆街道外环北路西安电子科技大学(南校区)"
	},
	"图书馆": {
		"latitude": 34.131068,
		"longitude": 108.838962,
		"address": "中国陕西省西安市长安区兴隆街道内环南路西安电子科技大学(南校区)"
	},
	"大学生活动中心": {
		"latitude": 34.133246,
		"longitude": 108.835001,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"北操场": {
		"latitude": 34.136866,
		"longitude": 108.837269,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"北篮球场": {
		"latitude": 34.135555,
		"longitude": 108.836914,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"北乒乓球场": {
		"latitude": 34.134767,
		"longitude": 108.836694,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"游泳中心": {
		"latitude": 34.135084,
		"longitude": 108.835939,
		"address": "中国陕西省西安市长安区兴隆街道外环北路西安电子科技大学(南校区)"
	},
	"南操场": {
		"latitude": 34.131775,
		"longitude": 108.834004,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"南篮球场": {
		"latitude": 34.129421,
		"longitude": 108.832629,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"南乒乓球场": {
		"latitude": 34.130221,
		"longitude": 108.833132,
		"address": "中国陕西省西安市长安区兴隆街道梧桐大道西安电子科技大学(南校区)"
	},
	"远望谷体育馆": {
		"latitude": 34.126451,
		"longitude": 108.844532,
		"address": "中国陕西省西安市长安区兴隆街道内环南路西安电子科技大学(南校区)"
	},
	"博物馆": {
		"latitude": 34.125711,
		"longitude": 108.843930,
		"address": "中国陕西省西安市长安区兴隆街道内环南路西安电子科技大学(南校区)"
	},
	"网安大楼": {
		"latitude": 34.128356,
		"longitude": 108.841998,
		"address": "中国陕西省西安市长安区兴隆街道内环南路西安电子科技大学(南校区)"
	},
	"礼仪广场": {
		"latitude": 34.132218,
		"longitude": 108.842061,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
};
