locations = {
	"A": {
		"latitude": 34.128406,
		"longitude": 108.826192,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"B": {
		"latitude": 34.132297,
		"longitude": 108.838367,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"C": {
		"latitude": 34.127330,
		"longitude": 108.828653,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"E": {
		"latitude": 34.126070,
		"longitude": 108.830365,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"F": {
		"latitude": 34.125917,
		"longitude": 108.831977,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"G": {
		"latitude": 34.124923,
		"longitude": 108.834318,
		"address": "中国陕西省西安市长安区兴隆街道内环北路西安电子科技大学(南校区)"
	},
	"信远": {
		"latitude": 34.126716,
		"longitude": 108.834931,
		"address": "中国陕西省西安市长安区兴隆街道外环北路西安电子科技大学(南校区)"
	}
}
